Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.sns_to_teams_invocations_anomaly will be updated in-place
~ resource "aws_cloudwatch_metric_alarm" "sns_to_teams_invocations_anomaly" {
        id                                    = "wrestleutopia-sns-to-teams-invocations-anomaly"
        tags                                  = {}
        # (22 unchanged attributes hidden)

      - metric_query {
          - id          = "m1" -> null
          - label       = "SnsToTeamsInvocationsWithAnomalyDetection" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (2 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "FunctionName" = "wrestleutopia-sns-to-teams"
                } -> null
              - metric_name = "Invocations" -> null
              - namespace   = "AWS/Lambda" -> null
              - period      = 300 -> null
              - stat        = "Sum" -> null
                # (1 unchanged attribute hidden)
            }
        }
      - metric_query {
          - expression  = "ANOMALY_DETECTION_BAND(m1, 2)" -> null
          - id          = "e1" -> null
          - label       = "AnomalyDetectionBand" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (1 unchanged attribute hidden)
        }
      + metric_query {
          + id          = "m1"
          + label       = "SnsToTeamsInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "sns_to_teams"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
        }
    }

  # aws_iam_role_policy.lambda_stepfunctions_policy will be created
+ resource "aws_iam_role_policy" "lambda_stepfunctions_policy" {
      + id          = (known after apply)
      + name        = "wrestleutopia_lambda_stepfunctions_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "states:PutResourcePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "wrestleutopia_lambda_role"
    }

  # aws_lambda_function.put_sfn_policy will be created
+ resource "aws_lambda_function" "put_sfn_policy" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/put_sfn_policy/put_sfn_policy.zip"
      + function_name                  = "put_sfn_policy"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::390402544450:role/wrestleutopia_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "EYyQT3d0qeJENlmrUx2wwAff6gcmLLyRP8zszsxry4k="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = "arn:aws:sqs:us-east-2:390402544450:wrestleutopia-lambda-dlq"
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.sns_to_teams must be replaced
-/+ resource "aws_lambda_function" "sns_to_teams" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-sns-to-teams" -> (known after apply)
      ~ code_sha256                    = "SmQeRJIPd007wVv/+NQjFyFye58FW3WeqzrCJ7OUBug=" -> (known after apply)
      ~ function_name                  = "wrestleutopia-sns-to-teams" -> "sns_to_teams" # forces replacement
      ~ id                             = "wrestleutopia-sns-to-teams" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-sns-to-teams/invocations" -> (known after apply)
      ~ last_modified                  = "2025-03-19T03:28:39.889+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-sns-to-teams:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-sns-to-teams:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 884 -> (known after apply)
      - tags                           = {} -> null
      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/wrestleutopia-sns-to-teams" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_sns_invoke must be replaced
-/+ resource "aws_lambda_permission" "allow_sns_invoke" {
      ~ function_name       = "wrestleutopia-sns-to-teams" -> "sns_to_teams" # forces replacement
      ~ id                  = "AllowExecutionFromSNS" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.sns_lambda_subscription must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_lambda_subscription" {
      ~ arn                             = "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic:7ed67c33-9edf-4d3c-a319-85ce4664366e" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:us-east-2:390402544450:function:wrestleutopia-sns-to-teams" -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic:7ed67c33-9edf-4d3c-a319-85ce4664366e" -> (known after apply)
      ~ owner_id                        = "390402544450" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_ssm_document.attach_sfn_policy will be updated in-place
~ resource "aws_ssm_document" "attach_sfn_policy" {
      ~ content          = jsonencode(
          ~ {
              ~ assumeRole    = "{{AutomationAssumeRole}}" -> "{{ AutomationAssumeRole }}"
              ~ description   = "Attach a Step Functions resource-based policy if missing" -> "Attach a resource-based policy to a Step Functions state machine (via Lambda)"
              ~ mainSteps     = [
                  ~ {
                      ~ action = "aws:executeAwsApi" -> "aws:invokeLambdaFunction"
                      ~ inputs = {
                          - Api          = "PutResourcePolicy"
                          + FunctionName = "MyPutResourcePolicyFunction"
                          + Payload      = {
                              + PolicyJson  = "{{ PolicyJson }}"
                              + ResourceArn = "{{ ResourceArn }}"
                            }
                          - Policy       = "{{ PolicyJson }}"
                          - ResourceArn  = "{{ ResourceArn }}"
                          - Service      = "states"
                        }
                      ~ name   = "AttachPolicy" -> "PutResourcePolicyViaLambda"
                    },
                ]
              ~ parameters    = {
                  ~ AutomationAssumeRole = {
                      - description = "(Recommended) The IAM role the runbook will assume. If omitted, the runbook will use the credentials of the user or service calling the runbook."
                        # (1 unchanged attribute hidden)
                    }
                  ~ PolicyJson           = {
                      - description = "The JSON representing the resource policy."
                        # (1 unchanged attribute hidden)
                    }
                  ~ ResourceArn          = {
                      - description = "The ARN of the Step Functions state machine or resource."
                        # (1 unchanged attribute hidden)
                    }
                }
                # (1 unchanged attribute hidden)
            }
        )
      ~ default_version  = "8" -> (known after apply)
      ~ document_version = "8" -> (known after apply)
      ~ hash             = "2f4ef61b4053d70f6b3de4b66ecc802bf1f2ea0caea6b30ffde6a0e6d678c885" -> (known after apply)
        id               = "AttachSFNResourcePolicy"
      ~ latest_version   = "8" -> (known after apply)
        name             = "AttachSFNResourcePolicy"
      ~ parameter        = [
          - {
              - description   = "The ARN of the Step Functions state machine or resource."
              - name          = "ResourceArn"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "The JSON representing the resource policy."
              - name          = "PolicyJson"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
          - {
              - description   = "(Recommended) The IAM role the runbook will assume. If omitted, the runbook will use the credentials of the user or service calling the runbook."
              - name          = "AutomationAssumeRole"
              - type          = "String"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        tags             = {}
        # (14 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 3 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 5 to add, 2 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```